{
  "train_image_dir": "D:\\BaiduNetdiskDownload\\数据集识别\\极验汉字分类_36w\\data",
  "test_image_dir": "./data/test/",
  "model_save_dir": "./checkpoints",
  "model_save_path":"./checkpoints/model.pth",
  "image_width": 180,
  "image_height": 100,
  "max_captcha": 1,
  "char_set": "丁七万丈上下不与丑专且世丘丙业丛东丝丢两严丧个丫中丰串临丸丹为主丽举乃久乇么义之乌乍乎乏乐乒乓乔乖乘乙乜九乞也习乡书买乱乳乾了予争亊事于亏云互五井亘亚亟亡亢交亥亦产亨享京亭亮亲人亿什仁仃仄仅仆仇今介仍从仑仓仔他仗付仙仞代令以仪们仰仲件价任份仿企伉伊伍伎伏伐休众优伙会伞伟传伤伥伦伪伫伯估伴伶伸伺似但位低住佐佑体何余佚佛作佞你佣佥佩佯佳佻使侈侉例侍侏侔侗供依侠侣侦侧侮侯侵便促俄俊俎俏俐俑俗俚保信俦俨俪俭修俯俱俾倍倏倒倔倕倘候倚倜借倡倥倦倨倩倪倭债值倾偃假偎偏偕做停健偬偶偷偻偿傅傍傥储催傲像僧僭僮僵僻儆儋儒允元兄充兆先光克免兔党兜兢入全公六兰共关兴兵其具典兹养兼兽冀冁内冈册再冒冕冗写军农冠冢冤冥冬冯冰冲决况冶冷冻净凄准凉凋凌减凑凛凝几凡凤凫凭凯凰凳凶凸出击函凿刀刃分切刈刊刍刎刑划刖列刘则刚创初删判刨利别刮到刳制刷券刺刻刿剁剂削前剑剔剖剜剥剧剩剪副割剽劈劓力劝办功加务劣动助努劫劬劭励劲劳势勃勇勉勋勒勘募勤勾勿匀包匈匍匐匕化北匝匠匡匣匪匮匹区医匿十千升午卉半华协卑卒卓单卖南博卜占卡卢卤卦卧卫卯印危即却卵卷卸卿厄厅历厉压厌厕厘厚厝原厢厥厦厨去县叁参又叉及友双反发取受变叙叛叟叠口古句另叨叩只叫召叮可台史右叵叶号司叹叼吁吃各合吉吊同名后吏吐向吒吕吗君吝吞吟吠否吧吩含听吭吮启吱吴吸吹吻吼吾呈告呕员呜呢周味呵呷呻呼命咀咂咄咆咋和咎咏咕咖咤咨咪咫咬咯咳咸咻咽哀品哄哇哈哉响哑哗哥哨哪哭哮哲哺唇唐唑唤售唯唱唾啄商啉啊啖啜啡啤啦啧啮啸啻啼喀喂善喇喉喊喘喙喜喝喟喧喱喷喻嗑嗒嗓嗔嗜嗟嗣嗤嗽嘉嘘嘛嘱嘲嘴嘶嘻嘿噎噙噜噤器噪噬噻嚎嚣嚼囊囚四回因团囤囫园困围囵固国图圃圆圈圜土圣在圪圭地圳场址坂均坊坎坏坐坑块坚坛坞坠坡坤坦坨坯坷坼垂垃型垒垛垢垣垦垩埃埋城埒埔埙域埴培基堂堆堑堕堡堤堪堰堵塌塑塔塘塞填境墉墓墙增墟墨墩壁壑壕壤士壬壮声壳壶壹处备复夏夕外夙多夜夤大天太夫夭央失头夷夸夹夺奇奈奉奋奎奏契奔奕奖套奚奠奢奥女奴好妁如妃妄妆妇妍妒妖妙妥妨妩妹妻姆姊始姐姓委姚姜姣姬姹姻姿威娆娇娈娉娜娟娥娱娴娶婀婚婢婷婿媒媚媲嫁嫉嫌嫠嫦嫩嫫嬉孔字存孙孚孜孝孟季孤孥学孳孺孽宁它宅宇守安宋完宏宕宗官定宛宜宝实宠审客宣室宪宫宰害宴宵家容宽宾宿寂寄寅密寇富寐寒寓寝寞察寡寤寥寨寮寰寸对寺寻导寿封射将尉尊小少尔尕尖尘尚尝尤尧就尹尺尻尼尽尾尿局层居屈届屋屏屐屑展属屠屡屣履屦屯山岁岂岐岑岗岛岩岭岱岳岵岸岿峋峙峡峥峦峨峭峰峻崖崛崞崤崧崩崭嵌嵘嵩嵬嶂嶙川州巡巢工左巧巨巫差巴巷巾币市布帅帆师希帏帐帔帕帖帘帙帚帛帝带席帮帷常帼帽幄幅幕幡干平年并幸幺幻幼幽庄庆床序庐庒库应底庖店庙庚府庞废度座庭庵庶康庸廉廊廓延廷建开异弃弄弈弊式弓引弗弘弛弟张弥弦弧弩弭弯弱弹强弼彀归当录彘彝形彤彩彪彭彰影役彻彼往征徂径待徇很徊律徒得徘徙徜御徨循徭微德徼徽心必忆忌忍忐忑志忘忙忠忧忪快忱念忸忻忽忾忿怀态怒怕怜思怠怡急性怨怩怪怯总恃恋恍恐恒恣恤恨恩恬恭息恰恶恸恻恼悃悉悌悔悖悚悛悟悠患悦悬悭悱悲悴悸悼情惊惑惕惚惜惟惠惧惨惩惫惬惭惮惯想惶惹惺愁愆愈愉意愚感愠愤愦愧愿慈慌慎慑慕慢慧慨慰慵慷憋憎憔憾懈懒懦懿戈戊戎戏成我戒或战戚戛戟戢截戮戴户戾房所扁扃扇扈扉手才扎扑扒打托扛扣执扪扫扬扭扮扯扰扳扶批扼找承技抄抉把抑抒抓投抖抗折抚抛抟抢护报披抱抵抹抽拂拄担拆拇拈拉拊拌拍拐拒拓拔拖拗拘拙招拜拟拢拣拥拦拨择括拭拯拱拳拼拽拾拿持挂指挈按挑挖挚挛挞挟挠挡挢挤挥挨挪挫振挹挺挽捆捉捋捎捏捐捕捞损换捣捧捭据捱捶捷捺掀掂掇授掉掌掎掐排掘掠探掣接控推掩措掬掰掷揆揉揎描提插揖揠握揣揪揭援揽搂搅搏搓搔搜搠搦搬搭搴携摄摆摇摔摘摧摩摸摹撑撒撕撞撤撩播撮撷撺撼擂擅操擎擐擒擗擘擞擢擤擦攀攒攘攫支收攸改攻放政故效敌敏救敕敖教敛敝敞敢散敦敬数敲整敷文斋斐斑斗料斛斜斟斤斧斩斫断斯新方施旁旄旅旋旌族旗无既日旦旧旨早旬旭旰旱时旷旺昂昃昆昊昌明昏易昔星映春昧昨昭是昼显晃晋晌晏晒晓晕晖晚晡晦晨普景晰晴晶晷智晾暄暇暑暖暗暮曙曜曝曦曰曲曳更曷曹曼曾替最月有朋服朐朔朗望朝期木未末本札术朱朴朵机朽杀杂权杆杉李杏材村杖杜杞束条来杨杭杯杰杳杵杷松板极构枇枉析枕林枘枚果枝枞枢枣枪枫枭枯枳枵架枷枸柁柄柏某柑染柔柙柚柜柝柠柢查柬柯柰柱柳柴柿栅标栈栉栋栏树栓栖栗校株样核根格桀桂桃案桉桐桑桔桡档桥桧桴桷梁梅梓梗梢梦梧梨梭梯械梳梵检棉棋棍棒棕棘棠森棱棹棺棼椅植椎椒椟椠椰椹椽椿楂楔楚楞楫楮楹楼概榄榆榈榕榛榜榨榫榭榱榴榷榻槁槊槌槐槛槟槽槿樊樟模樨横樯樱樵樽橄橐橘橙橛橱檀檐檗檬欠次欢欣欧欲欺款歃歇歉歌止正此步武歧歪歹死殁殃殆殇殉殊残殒殖殚殪段殷殿毁毂毅毋母每毒比毕毖毙毛毡毫毳氏民气氢氧氨氩氯水永氽汀汁求汇汉汔汗汜汝江池污汤汪汰汲汹汽沁沂沃沅沈沉沌沐沓沔沙沛沟没沤沥沦沧沪沫沭沮沱沲河沸油治沼沽沾沿泄泉泊泌泐泓泔法泗泛泡波泣泥注泪泮泰泳泼泽泾洁洋洒洗洛洞津洪洱洲活洽派流浃浅浆浇浊测济浏浑浒浓浙浜浦浩浪浮浴海浸浼涂涅消涉涌涎涓涔涕涛涟涠涣涤润涧涨涩涮涯液涵涸淀淆淇淋淑淘淡淬淮深淳混淹添清渊渍渎渐渑渔渚渝渠渡渣温渫渭港渲渴游渺湃湖湘湛湮湾湿溃溅源溘溜溢溥溪溯溲溴溶溷溺滂滇滋滑滓滔滚滞满滤滥滨滩滴漂漆漉漏漓演漠漫漱潇潘潜潢潦潭潮潸潼澄澈澌澎澜澧澳激濠濡濮濯瀑瀛灌火灭灯灰灵灶灸灼灾灿炉炊炎炒炕炖炙炝炫炭炮炳炸点炼炽烀烁烂烈烘烙烛烟烤烦烧烩烫烬热烯烹烽焉焕焖焙焚焦焰然煌煎煞煦照煨煮煲煽熊熏熔熘熙熟熨熬熳燃燎燔燕燥燮爆爨爪爬爰爱爵爼爽片版牌牍牖牙牛牝牡牢牦牧物牵特犀犁犊犬犯犴状犹狂狈狍狐狗狙狞狠狡独狮狰狱狴狸狼猊猎猕猛猜猥猩猫猬献猴猷猾猿獐玄率玉王玑玛玩玫环现玲玷玻珀珊珍珑珠珥班球琅理琉琊琐琢琥琨琪琳琴琵琶琼瑕瑙瑚瑜瑞瑟瑰瑶瑾璃璇璋璞璧瓜瓠瓢瓣瓤瓦瓮瓶瓷甍甑甘甚甜生用甩甫田由甲申电男甸画畀畅界畏畔留畜略番畴畸疆疏疑疗疙疚疤疥疫疮疲疵疼疾病症痈痒痔痕痛痰痴痹痼瘁瘗瘠瘢瘦瘩瘴癣癫癸登白百皂的皆皇皋皎皓皖皮皱皲盂盅盆盈益盎盏盐监盒盔盖盗盘盛盟目盲直相盹盼盾省眄眉看真眠眦眩眯眶眷眸眼着睁睃睐睚睛睡督睦睫睹睿瞄瞎瞑瞒瞧瞩瞪瞬瞰瞳瞻瞽矛矜矢矣知矩矫短石矶矾矿码砂砌砍研砖砚砣砥砭破砸砺砾础硅硈硎硒硕硗硝硫硬确碌碍碎碑碗碣碧碱碳磁磅磊磋磐磔磕磨磬磷磺礁礴示礼社祁祖祛祝神祟祥票祭祸禀禁禄福禧禹离禽禾秀私秃秉秋种科秒秕秘租秣秤秦积称移秽稀稂程稍税稔稠稳稷稻稼稽稿穆穑穗穰穴究穷空穿突窃窄窍窑窒窖窗窜窝窟窠窥窨立竖站竞竟章童竦竭端竹竺竽竿笃笋笏笑笔笙笠笤笥符笫第笼等筋筌筐筑筒答策筚筛筲筵筷筹签简箔箕算管箧箪箫箭箱箴箸篆篇篙篝篪篮篱篷簇簧簪簸簿籁籍米类籽粉粑粒粗粘粝粟粢粤粥粪粮粱粲粹粽精糁糅糊糌糍糕糖糗糙糜糟糠糯系素索紧紫累絮綮縻繁繇纂纠纡红纣纤约级纨纩纪纬纭纯纲纳纵纶纷纸纹纽线绁练组细织终绌绍绎经绑结绕绘给绚绛络绝绞统绠绢绣绥继绨绩绪绫续绯绰绳维绵绶绷绸综绽绾绿缁缄缎缓缕编缘缚缛缝缟缠缣缤缧缨缩缪缰缴缸缺罄罅罐网罔罕罗罚罩罪置署罴羁羊羌美羔羞羟羡群羯羸羹羼羽羿翁翅翔翕翘翠翡翥翦翰翱翻翼耀老考者耆耋而耐耕耗耘耙耨耳耸耻耿聆聊聋职聒联聘聚聩聪聱聿肃肆肇肉肋肌肖肘肚肝肠股肢肤肥肩肪肯肱育肴肺肼肾肿胀胁胃胄胆背胎胖胜胝胞胡胫胭胯胰胶胸胺能脂脆脉脊脍脏脐脑脖脚脯脱脸脾腊腋腌腐腑腔腕腥腧腩腮腰腴腹腺腻腼腾腿膀膂膊膏膑膘膛膜膝膨膳膺膻臂臆臧自臬臭至致臻臼臾舄舆舌舍舐舒舔舛舜舞舟航般舰舵船艇良艰色艳艴艺艾节芋芎芒芙芜芝芟芡芥芦芪芫芬芭芮芯花芳芷芸芹芽苄苋苌苍苏苑苒苓苔苕苗苛苞苟苡若苦苫苯英苹茁茂范茄茅茉茗茧茫茭茯茴茵茶茸茹茼荆草荏荐荒荔荛荜荞荟荠荡荣荤荦荧荪荫药荷荸荻荼荽莉莎莒莓莛莜莞莠莫莱莲莳莴获莸莹莺莼莽菁菇菌菘菜菠菩菱菲菽萁萃萄萌萍萎萘萝萤营萦萧萨萱萼落葑著葙葚葛葜葡董葩葫葭葱葵葺蒂蒙蒜蒡蒲蒸蒹蒿蓄蓉蓑蓝蓬蓼蔑蔓蔗蔚蔡蔬蔺蔼蔽蕃蕉蕊蕙蕤蕨蕴蕾薄薇薏薪薮薯薰藉藏藓藕藜藤藩藻藿蘑蘖蘸虎虐虑虚虞虢虫虬虮虱虹虺虾虿蚀蚁蚂蚊蚌蚍蚓蚕蚝蚩蚬蚵蛀蛇蛊蛋蛎蛏蛙蛛蛟蛤蛮蛰蛳蛹蛾蜀蜂蜃蜇蜉蜊蜕蜗蜚蜜蜞蜡蜷蝇蝉蝎蝙蝠蝴蝶蝼螂螃融螓螟螫螳螺螽蟆蟑蟒蟠蟹蟾蠖蠡蠹血衅行衍衔街衡衢衣补表衫衬衰衲衷衽衾衿袂袅袋袍袒袖袜被袭袷裁裂装裎裔裕裘裙裤裨裳裸裹裼裾褐褒褛褫褴襄襟西要覃覆见观规觅视览觉觌角觚觞解觥触言詈詹誉誓警譬计订认讥讨让讪训议讯记讲讳讷许讹论讼讽设访证诃评诅识诈诉诋诌词诎诏试诗诘诚诛话诞诟诡询诤该详诨诬语诮误诰诱诲诳说诵请诸诺读诽课诿谀谁调谄谅谇谈谊谋谎谏谐谑谓谔谗谘谙谛谟谠谢谣谤谦谨谩谬谭谮谲谴谷豁豆豇豉豌豕豚象豪豫豹豺貂貊貌贝贞负贡财责贤败账货质贩贪贫贬购贮贯贰贱贳贴贵贷贸费贺贻贼贾贿赀赁赂赃资赅赈赋赌赍赎赏赖赘赛赜赞赠赡赢赣赤赦赧赫走赴赵赶起趁趄超越趋趑趣足趴趼趾跃跋跌跎跑跖跗距跟跣跨跫跬路跳践跷跻踅踊踌踏踔踞踟踢踣踪踯踵蹀蹄蹇蹈蹉蹊蹋蹑蹙蹦蹬蹰蹲蹶蹿躁躇躞身躬躯躲躺车轨轩轫转轮软轰轲轴轶轸轹轻轼载轾辂较辄辅辇辈辉辍辏辐辑输辔辕辖辗辙辛辜辞辟辣辨辩辰辱边辽达迁迄迅过迈迎运近返还这进远违连迟迥迦迩迪迫迭述迳迷迸迹追退送适逃逅逆选逊逋逍透逐途逖通逛逝逞速造逡逢逮逸逻逾遁遂遄遇遍遏遐遑道遗遣遥遭遮遵遽避邀邂邈邑邓那邦邪邮邯邱邹邺邻郁郄郊郎郐郑郡郢部郫郭郸都鄂鄙酉酊酌配酒酚酣酥酪酬酮酯酰酱酶酷酸酾酿醅醇醉醋醍醐醒醚醛醪醮醯采释里重野量金釜鉴鑫针钉钓钗钙钜钝钞钟钠钢钥钧钩钱钳钵钺钻钾钿铁铃铄铅铎铗铜铝铢铤铩铭铵银铸铺链铿销锁锂锃锄锅锉锋锌锐错锡锣锤锥锦锭键锯锰锱锲锵锷锺锻镀镁镂镇镌镒镜镝镞镢镪镫镬镰镳镶长闪闭问闯闰闱闲闳间闵闷闹闺闻闽闾阁阅阉阋阍阎阐阑阒阔阖阗阙阚阜队阡阪阱防阳阴阵阶阻阿陀陂附际陆陇陈陋陌降限陕陟陡院除陨险陪陬陵陶陷隅隆隋随隐隔隗隘隙障隧隳难雀雁雄雅集雉雌雍雏雕雠雨雩雪雳零雷雾需霁霄霆震霉霍霏霓霖霜霞露霸霹青靓靖静靛非靠靡面靥革靴鞅鞋鞍鞘鞠鞫鞭韦韧韩韪韫韬韭音韵韶页顶项顺须顽顾顿颁颂预颅领颇颈颊颐频颓颔颖颗题颜额颠颤颦风飘飙飞食飧飨餍餐餮饔饕饥饨饩饫饭饮饯饰饱饴饵饶饺饼饽饿馀馄馅馆馈馋馍馏馐馒馓馔馕首馘香馥馨马驭驮驯驰驱驳驴驶驷驹驻驼驽驾驿骀骁骂骄骆骇骈骊骋验骏骐骑骓骖骗骚骛骤骥骧骨骸骼髓高髭髯鬓鬟鬲魁魂魃魄魅魉魍魏魑魔鱼鱿鲁鲇鲈鲍鲎鲐鲜鲞鲠鲢鲤鲥鲨鲩鲫鲮鲰鲳鲵鲶鲸鳄鳅鳊鳎鳕鳖鳗鳘鳜鳝鳞鸟鸠鸡鸣鸥鸦鸩鸭鸯鸳鸷鸽鸾鸿鹃鹄鹅鹊鹏鹑鹘鹜鹞鹤鹨鹪鹬鹭鹰鹿麈麋麒麟麦麸麻麾黄黍黎黏黑黔默黛黜黥黧黩黻黼鼎鼐鼓鼠鼷鼹鼻鼾齐齑齿龃龄龇龈龉龙龟",
  "server_url": "http://127.0.0.1:6000/b",
  "train_batch_size": 128,
  "test_batch_size": 100,
  "base_lr":0.001,
  "epoch": 2000
}